Charlesguo11/Heart-Rate-esp32s3/ESP32s3-EYE/human_face_detection/web/app_httpd.cpp
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include "app_httpd.hpp"
#include <stdio.h>
#include <stdlib.h>
#include <list>
#include "esp_http_server.h"
#include "esp_timer.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include "app_mdns.h"
#include "sdkconfig.h"
#include "who_camera.h"
#include <sys/types.h>  
#include <sys/socket.h>  
#include <netinet/in.h>  
#include <arpa/inet.h>  

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %d.%06d\r\n\r\n";

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#define TAG ""
#else
#include "esp_log.h"
static const char *TAG = "camera_httpd";
#endif

static QueueHandle_t xQueueFrameI = NULL;
static QueueHandle_t xQueueFrameO = NULL;
static bool gReturnFB = true;

static int8_t detection_enabled = 0;
static int8_t recognition_enabled = 0;
static int8_t is_enrolling = 0;

typedef struct
{
    httpd_req_t *req;
    size_t len;
} jpg_chunking_t;

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;

static size_t jpg_encode_stream(void *arg, size_t index, const void *data, size_t len)
{
    jpg_chunking_t *j = (jpg_chunking_t *)arg;
    if (!index)
    {
        j->len = 0;
    }
    if (httpd_resp_send_chunk(j->req, (const char *)data, len) != ESP_OK)
    {
        return 0;
    }
    j->len += len;
    return len;
}

static esp_err_t capture_handler(httpd_req_t *req)
{
    camera_fb_t *frame = NULL;
    esp_err_t res = ESP_OK;

    if (xQueueReceive(xQueueFrameI, &frame, portMAX_DELAY))
    {
        httpd_resp_set_type(req, "image/jpeg");
        httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.jpg");
        httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

        char ts[32];
        snprintf(ts, 32, "%ld.%06ld", frame->timestamp.tv_sec, frame->timestamp.tv_usec);
        httpd_resp_set_hdr(req, "X-Timestamp", (const char *)ts);

        // size_t fb_len = 0;
        if (frame->format == PIXFORMAT_JPEG)
        {
                // fb_len = frame->len;
            res = httpd_resp_send(req, (const char *)frame->buf, frame->len);
        }
        else
        {
            jpg_chunking_t jchunk = {req, 0};
            res = frame2jpg_cb(frame, 80, jpg_encode_stream, &jchunk) ? ESP_OK : ESP_FAIL;
            httpd_resp_send_chunk(req, NULL, 0);
            // fb_len = jchunk.len;
        }

        if (xQueueFrameO)
        {
            xQueueSend(xQueueFrameO, &frame, portMAX_DELAY);
        }
        else if (gReturnFB)
        {
            esp_camera_fb_return(frame);
        }
        else
        {
            free(frame);
        }
    }
    else
    {
        ESP_LOGE(TAG, "Camera capture failed");
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }

    return res;
}

static esp_err_t stream_handler(httpd_req_t *req)
{
    
    camera_fb_t *frame = NULL;
    struct timeval _timestamp;
    esp_err_t res = ESP_OK;
    size_t _jpg_buf_len = 0;
    uint8_t *_jpg_buf = NULL;

    res = httpd_resp_set_type(req, _STREAM_CONTENT_TYPE);
    if (res != ESP_OK)
    {
        return res;
    }

    if (xQueueReceive(xQueueFrameI, &frame, portMAX_DELAY))
    {
        _timestamp.tv_sec = frame->timestamp.tv_sec;
        _timestamp.tv_usec = frame->timestamp.tv_usec;

        if (frame->format == PIXFORMAT_JPEG)
        {
            _jpg_buf = frame->buf;
            _jpg_buf_len = frame->len;
        }
        else if (!frame2jpg(frame, 80, &_jpg_buf, &_jpg_buf_len))
        {
            ESP_LOGE(TAG, "JPEG compression failed");
            res = ESP_FAIL;
        }
    }
    else
    {
        res = ESP_FAIL;
    }
    httpd_resp_send_chunk(req, "", 0);
    ESP_LOGI(TAG, "httpd completed");

    if (res == ESP_OK)
    {
        //解码成功的，创建socket
        int serveSocket;
        int clientSocket;
        struct sockaddr_in server_addr;
        struct sockaddr_in client_addr;
        socklen_t sin_size;
        memset(&server_addr,0,sizeof(server_addr)); //数据初始化--清零  
        server_addr.sin_family=AF_INET; //设置为IP通信  
        server_addr.sin_addr.s_addr=INADDR_ANY;//服务器IP地址--允许连接到所有本地地址上  
        server_addr.sin_port=htons(8888); //服务器端口号  
        /*创建服务器端套接字--IPv4协议，面向连接通信，TCP协议*/  
        if((serveSocket=socket(PF_INET,SOCK_STREAM,0))<0)  
        {    
            ESP_LOGE(TAG, "socket error");
            return 1;  
        }  
        /*将套接字绑定到服务器的网络地址上*/  
        if(bind(serveSocket,(struct sockaddr *)&server_addr,sizeof(struct sockaddr))<0)  
        {  
            ESP_LOGE(TAG, "bind error");
            return 1;  
        }  
        ESP_LOGI(TAG, "server scocket created");
        /*监听连接请求--监听队列长度为1*/  
        if(listen(serveSocket,1)<0)  
        {  
            ESP_LOGE(TAG, "listen error");
            return 1;  
        };  
        sin_size=sizeof(struct sockaddr_in);  
        if((clientSocket=accept(serveSocket,(struct sockaddr *)&client_addr,&sin_size))<0)  
        {  
            ESP_LOGE(TAG, "accept error");
            return 1;  
        }  
        int frameLength = int(_jpg_buf_len);
        ESP_LOGI(TAG, "sending pic size %d",frameLength);  
        char lenStr[128];
        itoa(_jpg_buf_len,lenStr,10);
        send(clientSocket,lenStr,strlen(lenStr),0);
        char flag[1];
        while(1){
            recv(clientSocket,flag,1,0);
            if(isalpha(flag[0])) break;
        }
        ESP_LOGI(TAG,"size was recived");  
        ESP_LOGI(TAG,"sending pic");  
        send(clientSocket,(char*)_jpg_buf,_jpg_buf_len*8,0);
        ESP_LOGI(TAG, "all recieved");  
        close(serveSocket);
        close(clientSocket);
    }

    if (frame->format != PIXFORMAT_JPEG)
    {
        free(_jpg_buf);
        _jpg_buf = NULL;
    }

